# GROUP ACTIVITY

In this activity, there all 12 questions prepared with varying levels of difficulty. Your task is to answer as many as you can AS A GROUP. Each question is independent of one another. Delegate and strategize on how you will answer the most number of questions. **Good luck! :)**

#### First, setup the data

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
schools = pd.read_csv("schools_combined.csv")

C:\Users\christopher.gemida\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (10,11) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [82]:
schools

,Unnamed: 0,region,province,municipality,division,school_id,school_name,year_level,gender,enrollment,latitude,longitude,ID,Total_Enro,Total_Inst,Rooms_used,Rooms_unused,Type_of_Sc,Student_Teacher_Ratio,totalrooms
0,0,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 1,male,41,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes,0.050314,12.0
1,1,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 1,female,30,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes,0.050314,12.0
2,2,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 2,male,37,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes,0.050314,12.0
3,3,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 2,female,38,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes,0.050314,12.0
4,4,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 3,male,41,18.25096389,120.6089583,100002,318,16,12.0,0.0,School with no Annexes,0.050314,12.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
159739,159739,Region I - Ilocos Region,Ilocos Sur,City Of Candon,Candon City,322601,Candon City Information Technology NHS,second year,female,39,17.15986111,120.4347361,322601,216,8,7.0,0.0,School with no Annexes,0.037037,7.0
159740,159740,Region I - Ilocos Region,Ilocos Sur,City Of Candon,Candon City,322601,Candon City Information Technology NHS,third year,male,30,17.15986111,120.4347361,322601,216,8,7.0,0.0,School with no Annexes,0.037037,7.0
159741,159741,Region I - Ilocos Region,Ilocos Sur,City Of Candon,Candon City,322601,Candon City Information Technology NHS,third year,female,40,17.15986111,120.4347361,322601,216,8,7.0,0.0,School with no Annexes,0.037037,7.0
159742,159742,Region I - Ilocos Region,Ilocos Sur,City Of Candon,Candon City,322601,Candon City Information Technology NHS,fourth year,male,26,17.15986111,120.4347361,322601,216,8,7.0,0.0,School with no Annexes,0.037037,7.0
159743,159743,Region I - Ilocos Region,Ilocos Sur,City Of Candon,Candon City,322601,Candon City Information Technology NHS,fourth year,female,47,17.15986111,120.4347361,322601,216,8,7.0,0.0,School with no Annexes,0.037037,7.0

#### Before proceeding with the questions, check first with your groupmates if you all have the correct dataframe.

1. What is the size of the dataframe?

In [4]:
schools.shape

(159744, 18)

2. What are the columns?

In [5]:
schools.columns

Index(['Unnamed: 0', 'region', 'province', 'municipality', 'division',
       'school_id', 'school_name', 'year_level', 'gender', 'enrollment',
       'latitude', 'longitude', 'ID', 'Total_Enro', 'Total_Inst', 'Rooms_used',
       'Rooms_unused', 'Type_of_Sc'],
      dtype='object')

3. How many schools are there?

In [6]:
schools.school_id.nunique()
schools.school_name.nunique()

12015

4. How many missing values are there?

In [7]:
schools.isna().sum()

Unnamed: 0       0
region           0
province         0
municipality     0
division         0
school_id        0
school_name      0
year_level       0
gender           0
enrollment       0
latitude         0
longitude        0
ID               0
Total_Enro       0
Total_Inst       0
Rooms_used      12
Rooms_unused    12
Type_of_Sc       0
dtype: int64

Alright! Get started!

## Exercise

***Easy***

1. Which has a greater number of overall enrollees: males or females? (use `enrollment` column)

Insert markdown final answer:

In [8]:
schools.groupby("gender")[["Total_Enro"]].count().sort_values(by="Total_Enro", ascending=False)

        Total_Enro
gender
female       79872
male         79872

### ANSWER: schools.groupby("gender")[["Total_Enro"]].count().sort_values(by="Total_Enro", ascending=False)

2. How many municiapalities are covered by the dataframe?

Insert markdown final answer:

In [9]:
#Insert code here
schools["municipality"].nunique()

996

### ANSWER: schools["municipality"].nunique()

3. Which year_level has the highest number of enrollees? (use `enrollment` column)

Insert markdown final answer:

In [10]:
schools.groupby("year_level")[["enrollment"]].max().sort_values(by="enrollment", ascending=False)

             enrollment
year_level
first year         2339
second year        1848
third year         1797
fourth year        1468
grade 4             816
grade 2             802
grade 3             770
grade 1             727
grade 5             705
grade 6             698

### ANSWER: schools.groupby("year_level")[["enrollment"]].max().sort_values(by="enrollment", ascending=False)

4. Are the school_id equal to school_name? What is the discrepancy?

Insert markdown final answer:

In [11]:
schools.groupby(["school_id"])[["school_name"]].sum()
schools.school_id.nunique() == schools.school_name.nunique()

False

###  ANSWER: schools.groupby(["school_id"])[["school_name"]].sum() 
### schools.school_id.nunique() == schools.school_name.nunique()

5. How many teachers are there overall?

Insert markdown final answer:

In [12]:
schools["Total_Inst"].count()

159744

### ANSWER: schools["Total_Inst"].count()

***Medium***

6. Which province has the highest count of schools? How many is it?

Insert markdown final answer:

In [41]:
schools.groupby(['province'])[["school_name"]].nunique().sort_values(by="school_name", ascending=False)

                     school_name
province
Leyte                       1089
Pangasinan                   783
North Cotabato               690
Negros Oriental              678
Zamboanga Del Sur            655
...                          ...
Mountain Province              1
Sulu                           1
Zamboanga Del Norte            1
Apayao                         1
Abra                           1

[81 rows x 1 columns]

### schools.groupby(['province'])[["school_name"]].nunique().sort_values(by="school_name", ascending=False)

7. How many provinces only has one school? Which provinces are these?

Insert markdown final answer:

In [42]:
schools.groupby('province')['school_name'].nunique().nsmallest(10).to_frame()

                     school_name
province
Abra                           1
Apayao                         1
Mountain Province              1
Quirino                        1
Sulu                           1
Zamboanga Del Norte            1
Dinagat Islands                3
Maguindanao                    4
Siquijor                       4
Misamis Occidental             8

### schools.groupby('province')['school_name'].nunique().nsmallest(10).to_frame()

8. How many municipalities are there in ARMM?

Insert markdown final answer:

In [40]:
schools.groupby('region').get_group('ARMM - Autonomous Region in Muslim Mindanao')[['municipality']].nunique()

municipality    23
dtype: int64

### ANSWER: schools.groupby('region').get_group('ARMM - Autonomous Region in Muslim Mindanao')[['municipality']].nunique()

9. Which school has the most number of rooms (used + unused)?

Insert markdown final answer:

In [86]:
#Insert code here
schools[['totalrooms']] = schools["Rooms_used"] + schools["Rooms_unused"]
schools.groupby('school_name')[['totalrooms']].sum().sort_values(by="totalrooms", ascending=False)

                                 totalrooms
school_name
San Isidro ES                        5868.0
San Jose ES                          5664.0
San Vicente ES                       4404.0
Rizal ES                             3252.0
San Roque ES                         3108.0
...                                     ...
Basilica PS                             0.0
Muabog ES                               0.0
Taytayan ES                             0.0
Sixto Fajardo PS (La Esperenza)         0.0
Ilang-Ilang ES                          0.0

[12015 rows x 1 columns]

### schools[['totalrooms']] = schools["Rooms_used"] + schools["Rooms_unused"]
### schools.groupby('school_name')[['totalrooms']].sum().sort_values(by="totalrooms", ascending=False)

10. Within the schools in Central Visayas, how many female enrollees do they have all in all? (use `enrollment` column)

Insert markdown final answer:

In [68]:
schools[(schools["region"] == "Region VII - Central Visayas") & (schools["gender"] == "female")].groupby("gender")[["enrollment"]].sum().sort_values(by="enrollment", ascending=False)

        enrollment
gender
female      222644

### schools[(schools["region"] == "Region VII - Central Visayas") & (schools["gender"] == "female")].groupby("gender")[["enrollment"]].sum().sort_values(by="enrollment", ascending=False)

***Hard***

11. How many secondary students are there overall? (use `enrollment` column)

Insert markdown final answer:

In [37]:
#Insert code here
schools['year_level'].unique()
schools[schools["year_level"].str.contains("second year")]["enrollment"].sum()

764328

### schools['year_level'].unique()
### schools[schools["year_level"].str.contains("second year")]["enrollment"].sum()

12. Which school_id has the highest teacher-student ratio?

Insert markdown final answer:

In [19]:
#Insert code here
schools["Student_Teacher_Ratio"] = schools["Total_Inst"] / schools["Total_Enro"]
schools.groupby("school_id")[["Student_Teacher_Ratio"]].max().sort_values(by="Student_Teacher_Ratio", ascending=False)

           Student_Teacher_Ratio
school_id
319603                  0.334661
319602                  0.333333
102323                  0.300000
109414                  0.222222
125121                  0.214286
...                          ...
314206                  0.000000
125289                  0.000000
124875                  0.000000
313905                  0.000000
115275                  0.000000

[14003 rows x 1 columns]

### schools["Student_Teacher_Ratio"] = schools["Total_Inst"] / schools["Total_Enro"]
### schools.groupby("school_id")[["Student_Teacher_Ratio"]].max().sort_values(by="Student_Teacher_Ratio", ascending=False)